In [35]:
import numpy as np 
import pandas as pd

In [36]:
myindex = ['이순신', '김유신', '강감찬', '광해군', '연산군']
mycolumns = ['서울', '부산', '광주', '목포', '경주']
mylist = list( 10 * onedata for onedata in range(1, 26))
print(mylist)

[10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200, 210, 220, 230, 240, 250]

In [37]:
myframe = pd.DataFrame( np.reshape(mylist, (5, 5)), index=myindex, columns = mycolumns  )
myframe

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [48]:
print(type(myframe.columns))
# print(dir(myframe.columns))
print(myframe.columns)
print(myframe.columns[2])
print(myframe.columns[2])

<class 'pandas.core.indexes.base.Index'>
Index(['서울', '부산', '광주', '목포', '경주'], dtype='object')
광주

In [53]:
print(type(myframe.index))
print(myframe.index)
print(myframe.index[2])
print(myframe.index[2:3])
myframe.index.name = '이름'
print(myframe.index.name)
myframe

<class 'pandas.core.indexes.base.Index'>
Index(['이순신', '김유신', '강감찬', '광해군', '연산군'], dtype='object', name='이름')
강감찬
Index(['강감찬'], dtype='object', name='이름')
이름

      서울   부산   광주   목포   경주
이름
이순신   10   20   30   40   50
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [71]:
print(type(myframe['서울']))
print(myframe['서울'])
print(myframe['서울'].index)
print(myframe['서울'].index[0])
print(type(myframe['서울'].values))
print(type([1,2,3]))
myframe[['서울']]

<class 'pandas.core.series.Series'>
이름
이순신     10
김유신     60
강감찬    110
광해군    160
연산군    210
Name: 서울, dtype: int32
Index(['이순신', '김유신', '강감찬', '광해군', '연산군'], dtype='object', name='이름')
이순신
<class 'numpy.ndarray'>
<class 'list'>

      서울
이름
이순신   10
김유신   60
강감찬  110
광해군  160
연산군  210

In [68]:
print(myframe.loc['이순신'])
print(myframe.iloc[0])

서울    10
부산    20
광주    30
목포    40
경주    50
Name: 이순신, dtype: int32
서울    10
부산    20
광주    30
목포    40
경주    50
Name: 이순신, dtype: int32

In [70]:
print(myframe.loc[['이순신']])
print(myframe.iloc[[0]])

     서울  부산  광주  목포  경주
이름
이순신  10  20  30  40  50
     서울  부산  광주  목포  경주
이름
이순신  10  20  30  40  50

In [83]:
print(myframe.loc['김유신','부산'])
print(type(myframe.loc['김유신','부산']))
print(myframe.iloc[1,2])
print(type(myframe.iloc[1,1]))
print(myframe.loc[['김유신'],['부산']])
print(type(myframe.loc[['김유신'],['부산']]))

70
<class 'numpy.int32'>
80
<class 'numpy.int32'>
     부산
이름
김유신  70
<class 'pandas.core.frame.DataFrame'>

In [106]:
print(type(myframe.iloc[:,:]))
print(myframe.iloc[:,:])
print(myframe.iloc[0:2,0:2])
print(myframe.loc[['이순신','강감찬'],['부산','목포']])
print(myframe.loc['이순신':'강감찬','부산':'목포'])

<class 'pandas.core.frame.DataFrame'>
      서울   부산   광주   목포   경주
이름
이순신   10   20   30   40   50
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250
     서울  부산
이름
이순신  10  20
김유신  60  70
      부산   목포
이름
이순신   20   40
강감찬  120  140
      부산   광주   목포
이름
이순신   20   30   40
김유신   70   80   90
강감찬  120  130  140

In [107]:
myframe

      서울   부산   광주   목포   경주
이름
이순신   10   20   30   40   50
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [109]:
myframe['경주'] = 100
myframe

      서울   부산   광주   목포   경주
이름
이순신   10   20   30   40  100
김유신   60   70   80   90  100
강감찬  110  120  130  140  100
광해군  160  170  180  190  100
연산군  210  220  230  240  100

In [110]:
myframe.loc['강감찬'] = 100
myframe

      서울   부산   광주   목포   경주
이름
이순신   10   20   30   40  100
김유신   60   70   80   90  100
강감찬  100  100  100  100  100
광해군  160  170  180  190  100
연산군  210  220  230  240  100

In [111]:
myframe.loc['김유신','부산'] = 100
myframe

      서울   부산   광주   목포   경주
이름
이순신   10   20   30   40  100
김유신   60  100   80   90  100
강감찬  100  100  100  100  100
광해군  160  170  180  190  100
연산군  210  220  230  240  100

In [114]:
myframe['경주'] = myframe['경주'] + 5
myframe

      서울   부산   광주   목포   경주
이름
이순신   10   20   30   40  105
김유신   60  100   80   90  105
강감찬  100  100  100  100  105
광해군  160  170  180  190  105
연산군  210  220  230  240  105

In [117]:
myframe['목포+경주'] = myframe['목포'] + myframe['경주']
myframe

      서울   부산   광주   목포   경주  목포+경주
이름
이순신   10   20   30   40  105    145
김유신   60  100   80   90  105    195
강감찬  100  100  100  100  105    205
광해군  160  170  180  190  105    295
연산군  210  220  230  240  105    345

In [127]:
myframe['제주도'] = [10,10,10,10,10]

ValueError: Length of values (5) does not match length of index (7)

In [126]:
myframe.loc['이성계'] = [10,20,30,40,50,60]
myframe.loc['유관순'] = pd.Series([100,200,300,400,500,600],index=myframe.columns)
myframe

        서울     부산     광주     목포     경주  목포+경주
이름
이순신   10.0   20.0   30.0   40.0  105.0  145.0
김유신   60.0  100.0   80.0   90.0  105.0  195.0
강감찬  100.0  100.0  100.0  100.0  105.0  205.0
광해군  160.0  170.0  180.0  190.0  105.0  295.0
연산군  210.0  220.0  230.0  240.0  105.0  345.0
이성계   10.0   20.0   30.0   40.0   50.0   60.0
유관순  100.0  200.0  300.0  400.0  500.0  600.0

In [129]:
myframe['제주도'] = [10,10,10,10,10,10,10]
myframe['울산'] = pd.Series([10,10,10,10,10,10,10],index=myframe.index)
myframe

        서울     부산     광주     목포     경주  목포+경주  제주도  울산
이름
이순신   10.0   20.0   30.0   40.0  105.0  145.0   10  10
김유신   60.0  100.0   80.0   90.0  105.0  195.0   10  10
강감찬  100.0  100.0  100.0  100.0  105.0  205.0   10  10
광해군  160.0  170.0  180.0  190.0  105.0  295.0   10  10
연산군  210.0  220.0  230.0  240.0  105.0  345.0   10  10
이성계   10.0   20.0   30.0   40.0   50.0   60.0   10  10
유관순  100.0  200.0  300.0  400.0  500.0  600.0   10  10

In [136]:
myframe['총계'] = myframe.apply(np.sum,axis=1)
myframe.loc['총계'] = myframe.apply(np.sum,axis=0)
myframe

        서울     부산     광주      목포      경주   목포+경주   제주도    울산      총계
이름
이순신   10.0   20.0   30.0    40.0   105.0   145.0  10.0  10.0   370.0
김유신   60.0  100.0   80.0    90.0   105.0   195.0  10.0  10.0   650.0
강감찬  100.0  100.0  100.0   100.0   105.0   205.0  10.0  10.0   730.0
광해군  160.0  170.0  180.0   190.0   105.0   295.0  10.0  10.0  1120.0
연산군  210.0  220.0  230.0   240.0   105.0   345.0  10.0  10.0  1370.0
이성계   10.0   20.0   30.0    40.0    50.0    60.0  10.0  10.0   230.0
유관순  100.0  200.0  300.0   400.0   500.0   600.0  10.0  10.0  2120.0
총계   650.0  830.0  950.0  1100.0  1075.0  1845.0  70.0  70.0  6590.0

In [138]:
myframe['평균'] = myframe.loc[:,'서울':'울산'].apply(np.mean,axis=1)
myframe

        서울     부산     광주      목포      경주   목포+경주   제주도    울산      총계      평균
이름
이순신   10.0   20.0   30.0    40.0   105.0   145.0  10.0  10.0   370.0   46.25
김유신   60.0  100.0   80.0    90.0   105.0   195.0  10.0  10.0   650.0   81.25
강감찬  100.0  100.0  100.0   100.0   105.0   205.0  10.0  10.0   730.0   91.25
광해군  160.0  170.0  180.0   190.0   105.0   295.0  10.0  10.0  1120.0  140.00
연산군  210.0  220.0  230.0   240.0   105.0   345.0  10.0  10.0  1370.0  171.25
이성계   10.0   20.0   30.0    40.0    50.0    60.0  10.0  10.0   230.0   28.75
유관순  100.0  200.0  300.0   400.0   500.0   600.0  10.0  10.0  2120.0  265.00
총계   650.0  830.0  950.0  1100.0  1075.0  1845.0  70.0  70.0  6590.0  823.75

In [123]:
print(type(pd.Series([100,200,300,400,500,600])))

<class 'pandas.core.series.Series'>

In [ ]:
# 1 행만 Series로 읽어 오기')
result = myframe.iloc[1]
print(type(result))
result

In [ ]:
# 몇개의 행을 읽어 오기')
result = myframe.iloc[[1,3]]
print(type(result))
result

In [ ]:
# 짝수행만 가져 오기')
result = myframe.iloc[0::2]
result

In [ ]:
# 홀수행만 가져 오기 
# 이순신 행만 Series로 읽어 오기
result = myframe.loc['이순신']
type(result)
result

In [ ]:
# 이순신 행만 DataFrame으로 읽어 오기
result = myframe.loc[['이순신']]
type(result)
result

In [ ]:
# 강감찬와 이순신 행 읽어 오기
result = myframe.loc[['이순신', '강감찬']]
type(result)
result

In [ ]:
myframe.index
# myframe.columns

In [ ]:
mytarget = np.random.choice(myframe.index, 3)
mytarget

In [ ]:
result = myframe.loc[ mytarget ]
result

In [ ]:
# 강감찬의  광주 실적 정보 가져 오기
result = myframe.loc[['강감찬'], ['광주']] # DataFrame
result

In [ ]:
# 연산군와 광해군의 광주/목포 정보 가져 오기
result = myframe.loc[['연산군', '강감찬'], ['광주', '목포']]
result

In [ ]:
# 연속적인 데이터 가져 오기
result = myframe.loc['김유신':'광해군', '광주':'목포']
result

In [ ]:
# 김유신~광해군까지  부산 실적 정보 가져 오기
result = myframe.loc['김유신':'광해군', ['부산']]
result

In [ ]:
# Boolean으로 데이터 처리하기
result = myframe.loc[[False, True, True, False, True]]
result

In [ ]:
# 부산 실적이 100이하인 항목들
result = myframe.loc[ myframe['부산'] <= 100 ]
result

In [ ]:
# 목포 실적이 140인 항목들
result = myframe.loc[ myframe['목포'] == 140 ]
result

In [ ]:
cond1 = myframe['부산'] >= 70
cond2 = myframe['목포'] >= 140

type(cond1)

In [ ]:
cond1

In [ ]:
cond2

In [ ]:
df = pd.DataFrame([cond1, cond2])
df

In [ ]:
df.all()

In [ ]:
df.any()

In [ ]:
result = myframe.loc[ cond1 & cond2 ]
result

In [ ]:
result = myframe.loc[ (myframe['부산'] >=70) | (myframe['목포'] <=140) ]
result

In [ ]:
result = myframe.loc[ df.all() ]
result

In [ ]:
result = myframe.loc[ df.any() ]
result

In [ ]:
df

In [ ]:
result = myframe.loc[ lambda df : (df['부산'] >= 70)  & (df['목포'] <=140)  ]
result

In [ ]:
# 람다 함수의 사용
result = myframe.loc[ lambda df : df['광주'] >= 130  ]
result

In [ ]:
# 이순신과 강감찬의 부산 실적을 30으로 변경하기
myframe.loc[['이순신', '강감찬'], ['부산']] = 30
myframe

In [ ]:
## 김유신부터 광해군까지 경주 실적을 80으로 변경하시오.
myframe.loc['김유신':'광해군', ['경주']] = 80
myframe

In [ ]:
# 연산군의 모든 실적을 50으로 변경하기
myframe.loc[['연산군'], :] = 50
myframe

In [ ]:
# 모든 사람의 광주 컬럼을 60으로 변경하기
myframe.loc[:, ['광주']] = 60
myframe

In [ ]:
# 경주 실적이 150이하인 데이터를 모두 0으로 변경하기
myframe.loc[myframe['경주'] <= 150 , ['경주', '광주']] = 0
myframe

In [ ]:
# 데이터 프레임 사용하기
myframe